package ui

// Дюха, это чисто для структуры папок и описания работы с IntelliJ IDEA .Когда подгрузишь и прочтешь, можешь удалить.
// Крч все твое идет от папки ui, там я у тебя ниче не трогаю, только подгружаю себе, тесты потом намутим пока пофигу.
// Создавай тут все папки что нужны тебе. Если структуры новые надо создать скажи мне создам.
/*
тут че тебе надо сделать с IDE

Первое: в .idea/.gitignore добавь

Когда зайдешь, там будет clone git repo, клонируй
Каждый раз, когда садишься за код или хочешь отправить свой, делай эти шаги:
1. Скачивай обновленный код
   Нажми Ctrl + T и Git сам скачает изменения и склеит с твоим кодом.

2. Делай сохранения и коммиты после изменений
   Нажми Ctrl + K — откроется окно коммита.
   Выбери галочками свои измененные файлы (папки .idea и файлы .xml не нужны).
   Добавляй еще комменты к пушу на английском (чтобы по царски))) как песси)
   ну потом коммит и пуш, потом вылезет предупреждение, его игнорируй, дальше у тебя вылезет via че-то там,
   потом регаешься для jetbrains и все вроде, если че напиши мне



## 🛠 Что делать, если...

* **Код горит красным и ИДЕ не видит Kotlin:**
  Нажми `File` -> `Project Structure` -> `Modules`. Кликни на папку проекта и найди сверху кнопку **Setup Kotlin SDK** (или Configure Kotlin). Выбери версию Java (JDK 17/21) и нажми OK.

* **Появилось окно «Conflicts» (Конфликт):**
  Это значит, что мы одновременно правили одну и ту же строчку. Не паникуй! Нажми кнопку **Merge** (Объединить). ИДЕ откроет удобное окно из трех колонок: слева — твой код, справа — мой, по центру — результат. Просто стрелочками выбери, какой вариант правильный.

* **Кнопка Push ругается на ошибку авторизации (Authentication failed):**
  Проверь, под каким аккаунтом ты залогинен в браузере по умолчанию. Выйди из чужих аккаунтов, зайди в свой GitHub и попробуй нажать Push в IDEA заново.

*/