package ui

// Дюха, это чисто для структуры папок и описания работы с IntelliJ IDEA .Когда подгрузишь и прочтешь, можешь удалить.
// Крч все твое идет от папки ui, там я у тебя ниче не трогаю, только подгружаю себе, тесты потом намутим пока пофигу.
// Создавай тут все папки что нужны тебе. Если структуры новые надо создать скажи мне создам.
/*
тут че тебе надо сделать с IDE

Когда зайдешь, там будет clone git repo, клонируй
Каждый раз, когда садишься за код или хочешь отправить свой, делай эти шаги:
1. Скачивай обновленный код
   Нажми Ctrl + T и Git сам скачает изменения и склеит с твоим кодом.

2. Делай сохранения и коммиты после изменений
   Нажми Ctrl + K — откроется окно коммита.
   Выбери галочками свои измененные файлы (папки .idea и файлы .xml не нужны(ну и всяки .DS_store мусорные тоже не надо ))
   Добавляй еще комменты к пушу на английском (чтобы по царски))) как песси)
   ну потом коммит и пуш, потом вылезет предупреждение, его игнорируй, дальше у тебя вылезет via че-то там,
   потом регаешься для jetbrains и все вроде, если че напиши мне

Если нет подсказок и автоподставления то нажми File -> Project Structure -> Modules,  там плюсик и Kotlin/Kotlin JVM.
*/